# 02 - Explore Data

Libraries have pre-defined code for other functions that are not included in basic Python. Once a library has been imported, any of its functions can be used throughout the entire notebook.

In [16]:
#import libraries
import pandas as pd
import numpy as np

## Load data

### csv files

Stands for "comma separated values"; it is a plain text file where each value is separated by some delimiter (usually commas but can be tabs, semicolons, spaces, etc.)

In [ ]:
#load csv file data with headers

location = "datasets/smallgradesh.csv"
df = pd.read_csv(location)

In [19]:
df.head()
#df.head?

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
0,24,40,24,NaN,NaN,NaN,NaN,NaN,Maryland,5773552,2378814,5296486,2145283,5773552,5296486

In [20]:
df.tail(3)

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
0,24,40,24,NaN,NaN,NaN,NaN,NaN,Maryland,5773552,2378814,5296486,2145283,5773552,5296486

In [21]:
#load data without headers

location2 = "datasets/smallgrades.csv"
df_nohead = pd.read_csv(location2, header=None) #try w/o header=None
df_nohead.head()

         0     1
0   Marcia  82.4
1   Kadeem  78.2
2     Nash  79.3
3  Noelani  83.2
4  Noelani  87.4

In [22]:
#add headers during data load

df_during = pd.read_csv(location2, names=['Name', 'Grade'])
df_during.head()

      Name  Grade
0   Marcia   82.4
1   Kadeem   78.2
2     Nash   79.3
3  Noelani   83.2
4  Noelani   87.4

In [23]:
#add headers after data load

df_nohead.columns = ['Name', 'Grade']
df_nohead.head()

      Name  Grade
0   Marcia   82.4
1   Kadeem   78.2
2     Nash   79.3
3  Noelani   83.2
4  Noelani   87.4

In [24]:
#create data

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
GradeList = list(zip(names,grades))

In [25]:
#export csv files

df = pd.DataFrame(data = GradeList, columns=['Names','Grades'])
df.to_csv('studentgrades.csv',index=False,header=False)

### Your Turn
1) Can you make a dataframe from a file you have uploaded and
imported on your own? Let’s find out. Go to the census website
(http://census.ire.org/data/bulkdata.html) and download the csv datafile
for a state. Now try to import that data into python.

In [17]:
location = "all_040_in_24.P1.csv"
df = pd.read_csv(location)

2) Can you export the dataframe created by the following code to csv?
Creating a dataset for the exercise

In [40]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

Degrees = zip(names,grades,bsdegrees,msdegrees,phddegrees)
columns=['Names','Grades','BS','MS','PhD']
df = pd.DataFrame(data = Degrees, columns=columns)
df

TypeError: data argument can't be an iterator

In [35]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

Degrees = list(zip(names,grades,bsdegrees,msdegrees,phddegrees))
col = ['Names','Grades','BS','MS','PhD']
df = pd.DataFrame(data = Degrees, columns=col)
df

     Names  Grades  BS  MS  PhD
0      Bob      76   1   2    0
1  Jessica      95   1   1    1
2     Mary      77   0   0    0
3     John      78   0   0    0
4      Mel      99   1   0    0

In [36]:
df.to_csv('DanielGrades.csv',index=False,header=False)

### Excel files

In [ ]:
#import Excel file

location = "datasets/gradedata.xlsx"
df = pd.read_excel(location) #overwrites the info from the df variable in the examples above
df.head()

In [ ]:
#save dataframe as Excel file

#using GradeList from above
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
GradeList = list(zip(names,grades))

df = pd.DataFrame(data = GradeList, columns=['Names','Grades'])
writer = pd.ExcelWriter('dataframe.xlsx', engine='xlsxwriter')
df.to_excel(writer, sheet_name='Sheet1')
writer.save()

In [ ]:
#multiple sheets

df = pd.DataFrame(data = GradeList, columns=['Names','Grades'])
writer = pd.ExcelWriter('dataframe.xlsx', engine='xlsxwriter')
df.to_excel(writer, sheet_name='Sheet1')
df.to_excel(writer, sheet_name='Sheet2')
writer.save()

### Your Turn
1) Can you make a dataframe from a file you have uploaded
and imported on your own? Let’s find out. Go to this website
(https://www.census.gov/support/USACdataDownloads.html) and
download one of the excel datafiles at the bottom of the page. Now try to
import that data into python.

2) Can you export the dataframe created by the following code to excel? Creating a dataset for the exercise

In [57]:
import pandas as pd
names = ['Nike','Adidas','New Balance','Puma','Reebok']
grades = [176,59,47,38,99]
PriceList = zip(names,grades)
df = pd.DataFrame(data = PriceList, columns=['Names','Prices'])

TypeError: data argument can't be an iterator

In [38]:
import pandas as pd

In [42]:
names = ['Nike','Adidas','New Balance','Puma','Reebok']

In [43]:
grades = [176,59,47,38,99]

In [52]:
PriceList = list(zip(names, grades))

In [53]:
df = pd.DataFrame(data = PriceList, columns=['Names','grades'])

In [58]:
ames = ['Nike','Adidas','New Balance','Puma','Reebok']
grades = [176,59,47,38,99]
PriceList = list(zip(names, grades))

df = pd.DataFrame(data = GradeList, columns=['Names','Grades'])
writer = pd.ExcelWriter('dataframe.xlsx', engine='xlsxwriter')
df.to_excel(writer, sheet_name='Sheet1')
writer.save()

### Exploratory Analysis

In [ ]:
#load gradedata.csv file

location = "datasets/gradedata.csv"
df = pd.read_csv(location)

df.head()

In [ ]:
#show the column names in the dataset
df.columns
#or print(df.columns)

In [ ]:
#show the data type of each column
df.dtypes

In [ ]:
#number of non-NA values
#len(df) would count rows including NA values
df.count()

In [ ]:
df['hours'].max()

In [ ]:
df['hours'].min()

In [ ]:
df['hours'].sum()

In [ ]:
df['hours'].mean()

In [ ]:
df['hours'].median()

In [ ]:
df['hours'].mode()

In [ ]:
df['hours'].value_counts()

In [ ]:
#standard deviation
df['hours'].std()

In [ ]:
#descriptive statistics
df.describe()

In [ ]:
#doesn't do anything on its own
df.groupby('gender')

In [ ]:
#add a stats or math function to it
df['hours'].groupby(df['gender']).mean()

#mean of multiple columns
#df[['hours', 'exercise']].groupby(df['gender']).mean()

In [ ]:
#use two columns to groupby
df.groupby(['gender', 'age']).mean()

In [ ]:
#pivot table default function is mean
pd.pivot_table(df, index=['gender'])

In [ ]:
pd.pivot_table(df, values=['hours'], index=['gender'])

In [ ]:
#unique values in a column
df['age'].unique()

In [ ]:
#find missing values
filename = "datasets/gradedatamissing.csv"
df_missing = pd.read_csv(filename)

#df.head()

In [ ]:
#total missing values
df_missing.isnull().sum()

In [ ]:
#show rows with missing values
missing = df_missing['exercise'].isnull()
#missing will only show True/False values
df_missing.loc[missing]

### Your Turn
1) Take a look at datasets\dvddata.xlsx and do some exploratory analysis.

In [64]:
location = "datasets/gradedata.csv"
df = pd.read_csv(location)

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [65]:
df.columns

Index(['fname', 'lname', 'gender', 'age', 'exercise', 'hours', 'grade',
       'address'],
      dtype='object')

In [66]:
df.dtypes

fname        object
lname        object
gender       object
age           int64
exercise      int64
hours         int64
grade       float64
address      object
dtype: object

In [67]:
df.count()

fname       2000
lname       2000
gender      2000
age         2000
exercise    2000
hours       2000
grade       2000
address     2000
dtype: int64

In [68]:
df['hours'].value_counts()

11    196
10    188
12    179
9     156
14    155
13    152
8     143
15    123
7     110
6     106
16     93
5      83
17     81
18     61
4      58
3      40
19     34
20     22
2      15
0       3
1       2
Name: hours, dtype: int64

In [69]:
df['hours'].min()

0

In [71]:
df['hours'].std()
df.describe()
df.groupby('gender')

In [72]:
df['hours'].groupby(df['gender']).mean()

gender
female    10.932
male      11.045
Name: hours, dtype: float64

In [73]:
df.groupby(['gender', 'age']).mean()

            exercise      hours      grade
gender age
female 14   3.132911  10.658228  82.058228
       15   2.943038  11.050633  82.905696
       16   3.132911  11.158228  82.582278
       17   3.146893  10.943503  83.599435
       18   2.978022  10.950549  82.500000
       19   2.952096  10.832335  82.592216
male   14   2.822785  11.170886  82.323418
       15   3.021127  10.866197  82.671831
       16   2.994318  11.465909  82.752841
       17   2.927374  11.268156  82.949721
       18   2.982036  10.856287  82.103593
       19   2.977528  10.612360  81.598315

In [74]:
pd.pivot_table(df, index=['gender'])

           age  exercise    grade   hours
gender
female  16.568     3.047  82.7173  10.932
male    16.589     2.954  82.3948  11.045

In [75]:
df['age'].unique()

array([17, 18, 14, 16, 15, 19], dtype=int64)

In [77]:
filename = "datasets/gradedatamissing.csv"
df_missing = pd.read_csv(filename)

In [78]:
df_missing.isnull().sum()

fname       0
lname       0
gender      2
age         7
exercise    8
hours       8
grade       2
address     0
dtype: int64

In [79]:
missing = df_missing['exercise'].isnull()
#missing will only show True/False values
df_missing.loc[missing]

,fname,lname,gender,age,exercise,hours,grade,address
592,Mark,Hankerson,male,16.0,NaN,17.0,92.1,"3351 Hibiscus St. Miami, Fl 33133"
673,Jeremy,Rowe,male,19.0,NaN,10.0,83.4,"6 Madison St., Fall River, MA 02720"
683,Kalia,Moss,female,NaN,NaN,NaN,NaN,"760 East Stillwater St., Rosedale, NY 11422"
699,Gretchen,Haynes,female,NaN,NaN,NaN,77.2,"500 Border St., New Lenox, IL 60451"
700,Ruth,Bowman,female,NaN,NaN,NaN,100.0,"8621 Shub Farm Ave., Ocean Springs, MS 39564"
701,Eric,Walter,male,NaN,NaN,NaN,93.2,"416 Glendale Ave., Green Cove Springs, FL 32043"
884,Dara,Giles,female,15.0,NaN,17.0,88.4,"164 Shore Street, Wadsworth, OH 44281"
981,Fitzgerald,Barry,male,15.0,NaN,10.0,69.6,"836 N. Miles St., Oak Park, MI 48237"

In [82]:
location = "datasets\dvddata.xlsx"

In [83]:
location = "datasets\dvddata.xlsx"
df = pd.read_csv(location)

ParserError: Error tokenizing data. C error: Expected 2 fields in line 8, saw 3

In [84]:
import pandas as pd
import numpy as np

In [85]:
location = "datasets\dvddata.xlsx"

In [90]:
location = "datasets\dvddata.xlsx"
df = pd.read_EXCEL(location)

df.head()

AttributeError: module 'pandas' has no attribute 'read_EXCEL'

In [91]:
df.dtypes

fname        object
lname        object
gender       object
age           int64
exercise      int64
hours         int64
grade       float64
address      object
dtype: object

In [92]:
df.count()

fname       2000
lname       2000
gender      2000
age         2000
exercise    2000
hours       2000
grade       2000
address     2000
dtype: int64

In [100]:
dvd.groupby(['Region','District']).mean()

NameError: name 'dvd' is not defined

## Finding duplicate rows

In [ ]:
names = ['Jessica','John','Bob','Jessica','Mary','John','Mel','Mel']
grades = [95,78,76,95,77,78,99,100]
GradeList = list(zip(names,grades))
df = pd.DataFrame(data = GradeList, columns=['Names', 'Grades'])
df

In [ ]:
#boolean values for if there's another row with the exact values in each column
dupe = df.duplicated()
#duplicate of Jessica, 95; John, 78
#returns false on first instance of duplicate row

In [ ]:
df.loc[dupe]

### Your Turn
1) Load the dataset datasets/dupedata.csv. We figure people with the same
address are duplicates. Can you drop the duplicated rows while keeping
the first?

In [62]:
import pandas as pd
location = "datasets/dupedata.csv"
df = pd.read_csv(location)

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [63]:
names = ['Marcia','Kadeem','Nash','Noelani','Noelani']
age = [17,18,78,14,18,]
df = pd.DataFrame(data = GradeList, columns=['names', 'age'])
df

     names  age
0      Bob   76
1  Jessica   95
2     Mary   77
3     John   78
4      Mel   99

In [103]:
df = df.drop_duplicates('address', keep='first')
df

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"
5,Neil,Whitley,male,16,5,16,88.7,"40 Washington Ave., Bloomfield, NJ 07003"
6,Nelle,Golden,female,17,1,9,80.2,"9768 Hanover Dr., Meadville, PA 16335"
7,Armando,Hoffman,male,17,5,18,95.1,"360 Manor Drive, Northville, MI 48167"
8,Illiana,Rojas,female,15,5,9,76.5,"9425 Studebaker Dr., Thibodaux, LA 70301"
9,Neil,Wooten,male,15,3,15,89.7,"400 Bridge Court, Soddy Daisy, TN 37379"
10,Daquan,Alvarez,male,16,2,13,85.2,"9028 Arnold Circle, Elizabeth, NJ 07202"
11,Nola,Velazquez,female,15,2,10,75.3,"72 Bradford Dr., Carlisle, PA 17013"
12,Quinn,Warren,female,14,4,12,80.7,"760 Smith Street, Appleton, WI 54911"
13,Frances,Velasquez,female,15,2,15,84.2,"57 Bridge St., Tupelo, MS 38801"
14,Lareina,Poole,female,18,1,14,87.6,"59 Court Dr., Waxhaw, NC 28173"
15,Medge,Mccarthy,female,15,1,8,75.8,"609 Warren Court, Prior Lake, MN 55372"
16,Kibo,Gates,male,16,1,10,88.2,"24 Vernon Street, Helena, MT 59601"
17,Libby,Guzman,female,19,1,19,100.0,"666 S. Pennington Rd., Dover, NH 03820"
18,Shelly,Rosario,female,18,4,13,84.3,"571 Miles Street, Flowery Branch, GA 30542"
19,Lane,Tate,male,19,4,11,84.2,"4 Old Westport St., Glen Burnie, MD 21060"
20,Isadora,Case,female,18,3,11,79.1,"44 Ocean Lane, Appleton, WI 54911"
21,Maggy,Whitfield,female,15,1,15,90.5,"2 Henry Ave., Palm Bay, FL 32907"
22,Elton,Wagner,male,16,2,9,71.0,"98 Indian Spring St., Athens, GA 30605"
23,Lance,Benjamin,male,14,5,18,90.3,"55 Creek Dr., Lorton, VA 22079"
24,Kyle,Skinner,male,17,5,6,82.4,"8593 East Branch St., Mooresville, NC 28115"
25,Colin,Cohen,male,14,1,10,83.8,"23 Lakewood Street, Lake Worth, FL 33460"
26,Solomon,Mcpherson,male,15,5,18,94.5,"7465 North Pearl St., Massapequa Park, NY 11762"
27,Ulla,Warren,female,18,1,16,83.5,"89 Fairview Avenue, Hopkins, MN 55343"
28,Tyler,Collier,male,16,1,9,69.7,"65 Lookout Street, Marshfield, WI 54449"
29,Emma,Mccall,female,16,2,13,91.1,"854 Sussex Street, Westford, MA 01886"
...,...,...,...,...,...,...,...,...
1970,Armando,Mcclure,male,19,2,14,93.2,"23 Hall Road, Hagerstown, MD 21740"
1971,Haley,Mcgowan,female,17,3,16,90.4,"4 Wellington Street, Saint Louis, MO 63109"
1972,Fritz,Rojas,male,17,5,13,79.5,"16 East Edgewood St., Ashtabula, OH 44004"
1973,Allistair,Boyer,male,14,3,10,74.2,"9373 Helen Drive, Leland, NC 28451"
1974,Ella,Patterson,female,16,1,8,68.0,"999 Nicolls Avenue, Oviedo, FL 32765"
1975,Felix,Freeman,male,15,4,11,75.2,"671 Division Ave., Vineland, NJ 08360"
1976,Dean,Oneil,male,16,2,8,74.5,"653 East Saxton Lane, Framingham, MA 01701"
1977,Quinlan,Hawkins,male,14,3,18,85.6,"9437 Longbranch Street, Rockville, MD 20850"
1978,Kiara,Lott,female,17,2,12,82.7,"7110 Ridge Road, Jacksonville, NC 28540"
1979,Kai,Woodard,female,17,5,17,100.0,"37 Addison St., Eastpointe, MI 48021"
1980,Maxine,Raymond,female,17,4,19,91.9,"739 Thomas Court, Memphis, TN 38106"
1981,Leah,Lawrence,female,15,5,15,100.0,"652 Pine Drive, Mountain View, CA 94043"
1982,Kalia,Lewis,female,18,1,6,61.4,"557 Theatre Lane, Green Cove Springs, FL 32043"
1983,Anthony,Palmer,male,14,1,14,93.1,"914 NW. Lawrence Street, Lawrenceville, GA 30043"
1984,Joshua,Randolph,male,15,1,4,72.7,"9632 NE. Lakeshore St., Riverside, NJ 08075"
1985,Akeem,Luna,male,15,4,6,74.4,"750 Adams Drive, Goldsboro, NC 27530"
1986,Indigo,Mccoy,female,19,2,14,91.3,"9652 Columbia Ave., Chattanooga, TN 37421"
1987,Price,Wall,male,15,5,11,78.6,"8672 S. 53rd Drive, Waterford, MI 48329"
1988,Quinn,Patterson,male,15,1,14,78.0,"634 Cedar Swamp Ave., Burbank, IL 60459"
1989,John,Ford,male,14,2,14,91.2,"64 Devonshire Street, Orange Park, FL 32065"
1990,Adena,Battle,female,17,2,8,70.2,"9272 Elizabeth Drive, Londonderry, NH 03053"
1991,Craig,Obrien,male,16,3,7,64.9,"524 Park Ave., Hollywood, FL 33020"
1992,Isabelle,Barber,female,14,5,9,78.5,"955 Glen Ridge Rd., Plattsburgh, NY 12901"
1993,Risa,Watson,female,14,2,10,74.3,"37 Augusta Lane, Montgomery Village, MD 20886"
1994,Emerson,Gill,male,17,5,5,67.5,"75 Wild Horse Street, Panama City, FL 32404"
1995,Cody,Shepherd,male,19,1,8,80.1,"982 West Street, Alexandria, VA 22304"
1996,Geraldine,Peterson,female,16,4,18,100.0,"78 Morris Street, East Northport, NY 11731"
1997,Mercedes,Leon,female,18,3,14,84.9,"30 Glenridge Rd., Bountiful, UT 84010"
1998,Lucius,Rowland,male,16,1,7,69.1,"342 West Meadowbrook Lane, Helena, MT 59601"
1999,Linus,Morris,male,19,4,10,79.6,"81 Homestead Drive, Voorhees, NJ 08043"

## Choosing Rows

In [ ]:
colA = [10, 20, 40, 50]
colB = ['no', 'yes', 'yes', 'no']

A_B = list(zip(colA, colB))

df_A = pd.DataFrame(data=A_B, columns=['A', 'B'])
df_A

In [ ]:
index = ['a', 'b', 'c', 'd']
colA = [10, 20, 40, 50]
colB = ['no', 'yes', 'yes', 'no']

df_B = pd.DataFrame(data=A_B, columns=['A', 'B'], index=index)

df_B

In [ ]:
#loc: label based indexing
df_A.loc[0]

In [ ]:
#iloc: select row by index(position) number
df_A.iloc[0]

In [ ]:
#loc: label based indexing
df_B.loc['b']

In [ ]:
df_B.iloc[1]

In [ ]:
#let's see how it gets tricky
df_C = df_A.copy()
df_C

In [ ]:
index = [2,1,0,3]
colA = [10, 20, 40, 50]
colB = ['no', 'yes', 'yes', 'no']

df_D = pd.DataFrame(data=A_B, columns=['A', 'B'], index=index)
df_D

In [ ]:
#works like python slicing; give me index 0 through the index before 3
df_C.iloc[0:3]

In [ ]:
#give me the index label '0' and everything in between and include the label '3'
df_C.loc[0:3]

In [ ]:
#gave index position 0 through the index position before 3
df_D.iloc[0:3]

In [ ]:
#gave the label '0' and all the rows that are in between and ending with the row with label '3'
df_D.loc[0:3]

# Bonus Code!

Below are some code snippets for advanced tasks

## SQL

In [ ]:
from sqlalchemy import create_engine

# Connect to sqlite db
db_file = r'datasets/gradedata.db'
engine = create_engine(r"sqlite:///{}".format(db_file))

sql = "SELECT * FROM test;"
sales_data_df = pd.read_sql(sql, engine)
sales_data_df

In [ ]:
#find table names
sql = "SELECT name FROM sqlite_master WHERE type = 'table';"

In [ ]:
#query with conditional
sql = 'SELECT * FROM test WHERE Grades IN (76,77,78)'

## Load multiple data files

In [ ]:
import glob

all_data = pd.DataFrame()
for f in glob.glob("datasets/data*.xlsx"):
    df = pd.read_excel(f)
    all_data = all_data.append(df, ignore_index=True)
    
all_data.count() #each data file had 100 rows

### Your Turn
1) In the datasets/weekly_call_data folder, there are 104 files of weekly call
data for 2 years. Your task is to try to load all of that data into one data
frame.

## Create random data

In [ ]:
from numpy import random

names = ['Bob','Jessica','Mary','John','Mel']

random.seed(500)

random_names = [names[random.randint(low=0,high=len(names))] 
 				for i in range(1000)]

births = [random.randint(low=0,high=1000) 
 		  for i in range(1000)]

BabyDataSet = list(zip(random_names,births))
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])

df.head()

### Your Turn
1) Create a dataframe called parkingtickets with 250 rows containing a name
and a number between 1 and 25.